/* `welcomeLabel` UILabel text default value */
"Welcome" = "مرحبًا";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "شكرًا لتنزيل البرنامج";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "يُرجى اتباع التعليمات التي استلمتها في البريد الإلكتروني للترحيب لتبدأ عملية التنشيط.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "تابع إدارة مهامك اليومية وتعاون مع الزملاء في المشروعات بسهولة.";

"ScanInstruction" = "يُرجى مسح رمز QR الآمن لبدء عملية التنشيط.";

"DiscoveryServiceInstruction" = "يُرجى إدخال عنوان بريدك الإلكتروني لبدء عملية التنشيط.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "جارٍ فحص الحساب...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "بدء";

"Scan" = "مسح ضوئي";

/* `demoLabel` UILabel text default value */
"Explore" = "هل تود اكتشاف المزيد؟";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "تجربة العرض التوضيحي";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "تعيين رمز مرور";

/* The title for the enter passcode screen. */
"PasscodeKey" = "رمز المرور";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "اختيار رمز مرور";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "تأكيد رمز المرور";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "أدخل رمز المرور الخاص بك مرة أخرى.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "قم بتأكيد رمز المرور الخاص بك.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "أدخل رمز المرور الخاص بك.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "تغيير رمز المرور";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "أدخل رمز المرور  الخاص بك الحالي.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "ليس الآن";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "الخلف";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "التالي";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "تم";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "اختر رمز مرور مكونًا من %d من الأحرف على الأقل لإلغاء تأمين التطبيق.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "اختر رمز مرور مكونًا من %d من الأرقام على الأقل لإلغاء تأمين التطبيق.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "يتضمن التالي:";

/* The group name for lower case letters. */
"LowerCaseKey" = "أحرف صغيرة (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "أحرف كبيرة (A-Z)";

/* The group name for digits. */
"DigitsKey" = "أرقام (0-9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "رموز (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "إعادة تعيين رمز المرور";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "فشل تحقق صحة رمز المرور.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "تم رفض كلمة المرور بواسطة FUIPasscodeControllerDelegate.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "إعادة المحاولة";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " متوفر الآن!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "يوفر لك تمكين Touch ID وصولاً أسرع إلى معلوماتك.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "يمكنك تشغيل هذه الميزة أو إيقاف تشغيلها في أي وقت من الإعدادات.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "يُرجى تمكين Touch ID للوصول السريع والآمن.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "إذا تم إلغاء تنشيط Touch ID، سيُطلب منك إدخال رمز مرور الجهاز.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "يوفر لك تمكين Face ID وصولاً أسرع إلى معلوماتك.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "يمكنك تشغيل هذه الميزة أو إيقاف تشغيلها في أي وقت من الإعدادات.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "يُرجى تمكين Face ID للوصول السريع والآمن.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "إذا تم إلغاء تنشيط Face ID، سيُطلب منك إدخال رمز مرور الجهاز.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "لاستخدام Touch ID، يُرجى إضافة بصمات الأصابع في إعدادات جهازك.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "يمكنك القيام بذلك في أي وقت من الإعدادات - Touch ID ورمز المرور.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "لاستخدام Face ID، يُرجى تسجيل Face ID في إعدادات جهازك.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "يمكنك القيام بذلك في أي وقت من الإعدادات - Face ID ورمز المرور.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "تعرف على المزيد حول Touch ID";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "تعرف على المزيد حول Face ID";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "تمكين";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "المصادقة باستخدام Touch ID";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "المصادقة باستخدام Face ID";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "خطأ";

/* The error title. */
"AuthenticationErrorKey" = "خطأ في المصادقة";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "يُرجى المصادقة باستخدام Touch ID لاستخدام التطبيق.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "يُرجى المصادقة باستخدام Face ID لاستخدام التطبيق.";

/* The authenticate button text. */
"AuthenticateKey" = "مصادقة";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "رموز المرور غير مطابقة. حاول مرة أخرى.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "يتبقى لديك %d من المحاولات.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "يتبقى لديك محاولة واحدة.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "لم يتبقى لديك أي محاولات.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "يُرجى تسجيل الدخول لإعادة تعيين رمز المرور.";

/* The text of the dismiss button on the alert. */
"OKKey" = "موافق";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "رمز المرور غير صحيح. حاول مرة أخرى.";

/* The scan page title string. */
"ScanKey" = "مسح ضوئي";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "المسح الضوئي غير ناجح";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "يُرجى تحديد صورة رمز QR.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "رمز QR غير صالح";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "لم يتم التعرف على رمز QR.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "السماح بالوصول إلى الصور";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "لاختيار صورة رمز QR، يُرجى السماح بالوصول إلى صورك من إعدادات خصوصية جهازك.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "السماح بالوصول إلى الكاميرا";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "لإجراء المسح الضوئي باستخدام الكاميرا، يُرجى السماح بالوصول إلى الكاميرا من إعدادات خصوصية جهازك.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "الإعدادات";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "التأكيد";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "نجح المسح الضوئي. سيتم توصيلك بـ:";

/* The title string for the \"Continue\" button */
"ContinueKey" = "متابعة";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "بدء تشغيل";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "تنشيط";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "إذا تلقيت بريدًا إلكترونيًا للترحيب، يُرجى الدخول إلى ارتباط التنشيط الموجود به. إذا لم تتلق بريدًا إلكترونيًا، أدخل عنوان بريدك الإلكتروني أو امسح رمز QR ضوئيًا لبدء التشغيل.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "التالي";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "أو";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "مسح ضوئي";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "أوافق";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "لا أوافق";

/* The authentication title. */
"AuthenticationKey" = "المصادقة";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "يُرجى إدخال اسم المستخدم وكلمة المرور للمصادقة.";

/* Username input field placeholder string */
"usernameKey" = "اسم المستخدم";

/* Password input field placeholder string */
"passwordKey" = "كلمة المرور";

/* Sign In button string. */
"SignInKey" = "تسجيل الدخول";

/* Error message when failed to sign in. */
"SignInErrorKey" = "بيانات الاعتماد غير صحيحة. حاول مرة أخرى.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "يُرجى إدخال المعلومات أدناه لبدء عملية التنشيط.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "جار التحقق من صحة المعلومات...";

/* Cancel button string. */
"CancelKey" = "إلغاء";

/* Allow button string. */
"AllowKey" = "سماح";

/* Deny button string. */
"DenyKey" = "رفض";

/* No button string. */
"NoKey" = "لا";

/* Quit button string. */
"QuitKey" = "إنهاء";

/* GiveConsent button string. */
"GiveConsentKey" = "منح الموافقة";

/* Navbar title string. */
"StepKey" = "الخطوة";

/* Navbar title string. */
"OfKey" = "من";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "هل تريد بالتأكيد الخروج من عملية بدء التشغيل؟";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "دون الموافقة لن تصبح قادرًا على متابعة بدء التشغيل.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "تبديل أو إضافة المستخدم";

/* Title for Log In button */
"LogInKey" = "تسجيل الدخول";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "البحث عن المستخدمين في هذا الجهاز";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "هل نسيت رمز المرور؟";

/* Title for Loction */
"PNLoctionTitleKey" = "قم بتشغيل خدمات الموقع حتى تتمكن من استخدام ميزات الخريطة والتنقل";

/* Title for Notifications */
"PNNotificationsTitleKey" = "قم بتشغيل الإشعارات حتى تتمكن من الحصول على تنبيهات بشأن الإعلانات المهمة";

/* Title for Photos */
"PNPhotosTitleKey" = "قم بتشغيل الوصول إلى مكتبة الصور حتى تتمكن من تمكين مشاركة الصور والوصول إلى مكتبة الصور";

/* Title for Calendar */
"PNCalendarTitleKey" = "قم بتشغيل الوصول إلى التقويم حتى تتمكن من حجز الغرف ومشاهدة اجتماعاتك";

/* Title for Camera */
"PNCameraTitleKey" = "قم بتشغيل الكاميرا حتى تتمكن من تسجيل الدخول والتحقق باستخدام Face ID";

/* Subtitle for FUIPrivacyNoticeView */
"PNSubtitleKey" = "يمكنك تغيير هذا الإذن لاحقًا باستخدام إعدادات التطبيق";

/* FooterText for FUIPrivacyNoticeSettingsController */
"PNSettingsFooterTextKey" = "يستخدم التطبيق الأذونات أدناه لتزويدك بأفضل تجربة نقدمها لك";

/* FooterText of Location for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsLocationFooterTextKey" = "اسمح للتطبيق بالوصول إلى موقعك وإعلامك عند استخدامه.\n\nلتعيين إذن الموقع أو تعديله، افتح إعدادات iOS > اضغط على \"الموقع\"> اضغط على \"التطبيق\"> حدد إعداد إذن الموقع المفضل لديك";

/* FooterText of Notifications for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsNotificationsFooterTextKey" = "اسمح للتطبيق بالوصول إلى إشعاراتك وإعلامك عند استخدامها.\n\nلتعيين إذن الإشعارات أو تعديله، افتح إعدادات iOS > اضغط على \"الإشعارات\"> اضغط على \"التطبيق\"> حدد إعداد إذن الإشعارات المفضل لديك";

/* FooterText of Photos for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsPhotosFooterTextKey" = "اسمح للتطبيق بالوصول إلى صورك وإعلامك عند استخدامها.\n\nلتعيين إذن الصور أو تعديله، افتح إعدادات iOS > اضغط على \"الصور\"> اضغط على \"التطبيق\"> حدد إعداد إذن الصور المفضل لديك";

/* FooterText of Camera for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCameraFooterTextKey" = "اسمح للتطبيق بالوصول إلى كاميراتك وإعلامك عند استخدامها.\n\nلتعيين إذن الكاميرا أو تعديله، افتح إعدادات iOS > اضغط على \"الكاميرا\"> اضغط على \"التطبيق\"> حدد إعداد إذن الكاميرا المفضل لديك";

/* FooterText of Calendar for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingsCalendarFooterTextKey" = "اسمح للتطبيق بالوصول إلى تقويمك وإعلامك عند استخدامه.\n\nلتعيين إذن التقويم أو تعديله، افتح إعدادات iOS > اضغط على \"التقويم\"> اضغط على \"التطبيق\"> حدد إعداد إذن التقويم المفضل لديك";

/* The button title for FUIPrivacyNoticeOpenSettingsController */
"PNOpenSettingKey" = "فتح إعدادات iOS";

